#!/usr/bin/env python
# coding:utf8

import __init__
import sys
# del sys.path[1]
# del sys.modules['__init__']
from utils.CollectionHelper import CollectionHelper

# CollectionHelper.printEx(sys.modules)
print "*" * 88
# CollectionHelper.printEx(sys.path)

##############################################################################################
#   test.py
##############################################################################################
# bar = 123
# def show():
#   print bar
#
#
##############################################################################################
#    import.py
##############################################################################################
#  from test import bar,show
#  show()
#  bar = 'abc'
#  show()
#  print bar
#
##############################################################################################
#  running :
#       123
#       123
#       'abc'
#
##############################################################################################
#  tips:
#       导入模块或者模块中变量，只是改变当前名称空间映射关系，并没有实际创建这些被导入的对象
#       当在当前名称空间中重新声明定义对象时，会实实在在创建对象，并修改当前名称空间映射关系
#
